In [11]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"]  =(20,10)

In [12]:
df_price = pd.read_csv("data_set/bengaluru_house_prices.csv")

In [13]:
df_price.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [15]:
df_price.shape

(13320, 9)

In [42]:
grouped_data = df_price.groupby('area_type')[['area_type','availability']].count()
print(grouped_data[['area_type','availability']])
#we are grouping area_type then making table with only two coulmns area_type and availablity

                      area_type  availability
area_type
Built-up  Area             2418          2418
Carpet  Area                 87            87
Plot  Area                 2025          2025
Super built-up  Area       8790          8790

In [45]:
filtered_df = df_price.drop(['area_type', 'society', 'balcony','availability'],axis='columns')
filtered_df.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [47]:
filtered_df.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [63]:
filtered_df_with_na = filtered_df[filtered_df.isna().any(axis=1)]

In [55]:
print(filtered_df_with_na.head(20))

            location       size         total_sqft  bath    price
56       Devanahalli  4 Bedroom        3010 - 3410   NaN  192.000
81       Hennur Road  4 Bedroom        2957 - 3450   NaN  224.500
224      Devanahalli      3 BHK        1520 - 1740   NaN   74.820
344   Kanakpura Road      1 BHK                525   NaN   21.530
568              NaN      3 BHK               1600   3.0   86.000
579   Sarjapur  Road        NaN        1200 - 2400   NaN   34.185
669         JP Nagar      5 BHK        4400 - 6640   NaN  375.000
702         JP Nagar      5 BHK        4400 - 6800   NaN  548.500
801         JP Nagar      4 BHK        4000 - 5249   NaN  453.000
941       Whitefield  4 Bedroom        3606 - 5091   NaN  304.000
1264          Hennur  3 Bedroom               2264   NaN  155.000
1267       Yelahanka      3 BHK        1440 - 1884   NaN   67.980
1686      Whitefield      1 BHK          660 - 670   NaN   28.585
1724     Thanisandra      1 BHK          620 - 933   NaN   48.145
1765      Binny Pete      4 BHK        2695 - 2940   NaN  204.000
1775        IVC Road        NaN        2000 - 5634   NaN  124.000
1852       Yelahanka      4 BHK        3450 - 3472   NaN  173.000
2264    Banashankari        NaN               2400   NaN  460.000
2500          Jakkur      4 BHK  2249.81 - 4112.19   NaN  260.500
2563    Rajaji Nagar      4 BHK        3436 - 3643   NaN  424.500

In [70]:
filtered_df_without_na = filtered_df.dropna()
filtered_df_without_na.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [68]:
filtered_df_without_na.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [73]:
filtered_df_without_na['size'].unique() #here we are making a set of unique values

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [76]:
filtered_df_without_na['bhk'] = filtered_df_without_na['size'].apply(lambda x: int(x.split(' ')[0]))
#here we are making a new column with the data from size column and appling a lambda function to it to extract the no of rooms in it by spliting and taking the first half of the data

C:\Users\rohit.sharma\AppData\Local\Temp\ipykernel_10508\553274001.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_df_without_na['bhk'] = filtered_df_without_na['size'].apply(lambda x: int(x.split(' ')[0]))

In [75]:
filtered_df_without_na.head()

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [77]:
filtered_df_without_na[filtered_df_without_na.bhk>20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [78]:
filtered_df_without_na.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [83]:
def is_real_numb(x):
    try: 
        float(x)
    except:
        return False
    return True

In [114]:
filtered_df_without_na[~filtered_df_without_na['total_sqft'].apply(is_real_numb)].head()

               location   size   total_sqft  bath    price  bhk
30            Yelahanka  4 BHK  2100 - 2850   4.0  186.000    4
122              Hebbal  4 BHK  3067 - 8156   4.0  477.000    4
137  8th Phase JP Nagar  2 BHK  1042 - 1105   2.0   54.005    2
165            Sarjapur  2 BHK  1145 - 1340   2.0   43.490    2
188            KR Puram  2 BHK  1015 - 1540   2.0   56.800    2

In [116]:
filtered_df_without_na.loc[137]

location      8th Phase JP Nagar
size                       2 BHK
total_sqft           1042 - 1105
bath                         2.0
price                     54.005
bhk                            2
Name: 137, dtype: object

In [93]:
# this function is taking average of range based entries and a
def convert_sqft_to_num(x):
    tokens = x.split('-')
    if len(tokens) == 2:
        return (float(tokens[0]) + float(tokens[1]))/2
    try:
        return float(x)
    except: 
        return None

In [97]:
convert_sqft_to_num('2123 - 2900')  #test

2511.5

In [99]:
filtered_data = filtered_df_without_na.copy()

In [100]:
filtered_data['total_sqft'] = filtered_data['total_sqft'].apply(convert_sqft_to_num)

In [119]:
filtered_data.loc[137]  #test

location      8th Phase JP Nagar
size                       2 BHK
total_sqft                1073.5
bath                         2.0
price                     54.005
bhk                            2
Name: 137, dtype: object

In [120]:
filtered_data_1 = filtered_data.copy()

In [121]:
filtered_data_1['price_per_sqft'] = filtered_data_1['price']*100000/filtered_data_1['total_sqft']
filtered_data_1.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [122]:
len(filtered_data_1.location.unique())

1304